Repository: earthxp7/Hi-Matic
Catalog: lib/l10n/app_*.arb
Languages: th, zh

# language
source: Change language
th: เปลี่ยนภาษา
zh: 改變語言

# touch
source: Tap to start ordering food
th: แตะเพื่อเริ่มสั่งอาหาร
zh: 點擊開始點餐

# topic
source: Order Process
th: ขั้นตอนการสั่งซื้อ
zh: 訂單流程

# start
source: Tap To Start
th: แตะเพื่อเริ่มต้น
zh: 點擊開始

# process1
source: Select Items For Cart
th: เลือกสินค้าลงตะกร้า
zh: 選擇要加入購物車的產品

# process2
source: Choose Payment Method
th: เลือกวิธีการชำระเงิน
zh: 選擇付款方式

# process3
source: Payment
th: ชำระเงิน
zh: 付款

# process4
source: Awaiting Delivery And Change
th: รอรับสินค้าและเงินทอน
zh: 等待收到產品並更改

# choose
source: Choose Dine-In or Take Away
th: สั่งอาหารทานที่ร้านหรือสั่งกลับบ้าน
zh: 選擇在餐廳用餐或訂購帶回家

source: Dine-In
th: ทานที่ร้าน
zh: 在餐廳吃飯

source: Take Away
th: สั่งกลับบ้าน
zh: 訂外賣

# category
source: Category {index}
th: หมวดหมู่ที่ {index}
zh: 類別 {index}

source: Note
th: รายละเอียดเพิ่มเติม
zh: 更多的

# add_order
source: Add To List
th: เพิ่มลงในรายการ
zh: 添加到列表

# ex
source: eg.. No Vegetable
th: เช่น.. ไม่ใส่ผัก
zh: 例如，不要添加蔬菜

# total
source: Total Payment
th: ยอดชำระทั้งหมด
zh: 付款總額

source: Product Details
th: รายละเอียดสินค้า
zh: 產品詳情

source: Amount
th: จำนวน
zh: 數量

# addMenu
source: Add To Cart
th: เพิ่มลงในตะกร้า
zh: 加入購物車

# summary
source: Order Summary
th: สรุปรายการสั่งซื้อ
zh: 訂單匯總

# payment_amount
source: Payment Total
th: ยอดชำระ
zh: 支付金額

# choose_payment
source: Select Payment
th: เลือกวิธีการชำระเงิน
zh: 選擇付款方式

source: Cancel Order
th: ยกเลิกคำสั่งซื้อ
zh: 取消訂單

source: Cash
th: เงินสด

source: PromptPay
th: พร้อมเพย์

source: True Money
th: ทรู มันนี่

# weChat
source: WeChat Pay
th: วีแชท เพย์

source: Shopee Pay
th: ช้อปปี้ เพย์

# rabbit
source: Rabbit Line Pay
th: แรบบิท ไลน์ เพย์

source: Ali Pay
th: อาลี เพย์

# total_payment
source: Payment Total
th: ยอดชำระเงินทั้งหมด
zh: 付款總額

# wait
source: Wait A Moment..
th: กรุณารอสักครู่..
zh: 請稍候..

source: Please Pay
th: กรุณาชำระเงิน
zh: 請付款

source: Payment Failed
th: ชำระเงินไม่สำเร็จ
zh: 支付失敗

source: Cancel Payment?
th: ยกเลิกการชำระเงินหรือไม่
zh: 取消付款

# cancellation_reminder
source: Note: If Payment Has Already Been Made The Cabinet Will Not Deliver Products
th: หมายเหตุ: หากชำระเงินเรียบร้อยแล้ว ตู้จะไม่นำจ่ายสินค้า
zh: 注：如果已经付款柜子不会发货

# confirm_cancel
source: Yes
th: ใช่
zh: 是的

# not_cancel
source: No
th: ไม่
zh: 不

# system_crash
source: The System Is Temporarily Down. We Apologize For The Inconvenience
th: ระบบขัดข้องชั่วคราวขออภัยในความไม่สะดวก
zh: 系统暂时故障 为不便之处致以歉意

source: Payment Completed
th: ชำระเงินสำเร็จ
zh: 付款完成

# product_dispenser
source: The Cabinet Is Dispensing Products
th: ตู้กำลังจ่ายสินค้า
zh: 柜子正在分发产品

# receive_product
source: Please Receive Your Item
th: กรุณารับสินค้าของคุณ
zh: 请收到您的物品

# get_change
source: Please Take The Change
th: กรุณารับเงินทอน
zh: 请拿零钱

# thank_you
source: Thank You For Using The Service
th: ขอบคุณที่ใช้บริการ
zh: 感谢您使用该服务

# unsuccessful
source: Unsuccessful Payment
th: จ่ายสินค้าไม่สำเร็จ
zh: 付款失败

# important_details
source: Please select complete food details
th: กรุณาเลือกรายละเอียดอาหารให้ครบถ้วน
zh: 請選擇完整的食物詳細資料

# check_food_list
source: Check your food information (e.g. Meat, Spiciness level)
th: ตรวจสอบข้อมูลอาหารของท่าน(เช่น เนื้อสัตว์ ระดับความเผ็ด)
zh: 檢查您的食物資訊（例如肉類、辣度

source: Food prices
th: ราคาอาหาร
zh: 食品價格

# head_cancel_payment
source: Cancel payment?
th: ยกเลิกการชำระเงิน
zh: 取消付款

# detail_cancel_payment
source: Do you want to cancel your payment?
th: คุณต้องการยกเลิกการชำระเงินหรือไม่
zh: 您想取消付款嗎？

# agree
source: Confirm
th: ตกลง
zh: 同意

source: Cancel
th: ยกเลิก
zh: 取消

# head_return_home_page
source: Return to the main page?
th: ย้อนกลับไปยังหน้าหลัก?
zh: 返回主頁？

# detail_return_home_page
source: The food item you selected will be deleted
th: รายการอาหารที่ท่านเลือกไว้จะถูกลบออก
zh: 您選擇的食物項目將被刪除

# head_no_food
source: No food items found
th: ไม่พบรายการอาหารของท่าน
zh: 未找到您的食品

# detail_no_food
source: Please select your meal before paying
th: กรุณาเลือกอาหารก่อนชำระเงิน
zh: 請在付款前選擇您的食物

# please_choose_food
source: Please choose the food you want
th: โปรดเลือกอาหารที่ท่านต้องการ
zh: 請選擇您想要的食物

# setting_page
source: Settings
th: การตั้งค่า
zh: 設定

# confirm_close_app
source: Close The Application?
th: คุณต้องการปิดแอปพลิเคชัน?
zh: 關閉應用程式?

# confirm_open_network_system
source: Open Network System Page?
th: เปิดหน้าควบคุมเครือข่าย?
zh: 開啟網路系統頁面?

# confirm_open_android_system
source: Open Android System Page?
th: เปิดหน้าระบบปฎิบัติการแอนดรอยด์?
zh: 打開Android系統頁面？

# confirm_return_menu_page
source: Return To Menu Page?
th: กลับไปที่หน้าเมนู?
zh: 返回選單頁？

source: Print Test
th: ทดสอบการพิมพ์
zh: 列印測試

# save_data
source: Save And Apply
th: บันทึกค่าและนำไปใช้
zh: 儲存並應用

# return_menu_page
source: Return To Menu Page
th: กลับไปที่หน้าเมนู
zh: 返回選單頁

# confirm_identity
source: Please Confirm Your Identity
th: กรุณายืนยันตัวตน
zh: 請確認您的身分

# enter_password
source: Enter Your Password
th: ใส่รหัสของคุณที่นี่
zh: 輸入您的密碼

# failed_identity
source: Failed to verify identity
th: การยืนยันตัวตนไม่ผ่าน
zh: 身份驗證失敗

# input_ip
source: Enter Your IP
th: ใส่ IP ของคุณ
zh: 輸入您的IP

# no_payment_method
source: No payment method found
th: ไม่พบช่องทางการชำระเงิน
zh: 未找到付款方式

# detail_no_payment_method
source: Please select a payment method that is ready to be processed
th: กรุณาเลือกช่องทางการชำระเงืนที่พร้อมดำเนินการ
zh: 請選擇付款方式。準備好處理的資金
